"""
Тимофей обычно спит ночью X часов и устраивает себе днем тихий час на Y минут.
Определите, сколько всего минут Тимофей спит в сутки.

Sample Input:
7
30

Sample Output:
450
"""
print(int(input()) * 60 + int(input()))

